`terraform plan` output for pangeo-hubs.

<details>
<pre>
[0m[1mgoogle_artifact_registry_repository.registry: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1/repositories/pangeo-hubs-registry][0m
[0m[1mgoogle_project_iam_custom_role.identify_project_role: Refreshing state... [id=projects/pangeo-integration-te-3eea/roles/pangeo_hubs_user_sa_role][0m
[0m[1mgoogle_service_account.cd_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_service_account.cluster_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_bucket.user_buckets["pangeo-scratch"]: Refreshing state... [id=pangeo-hubs-pangeo-scratch][0m
[0m[1mgoogle_service_account_key.cd_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com/keys/a49552f97c52549eff834dd54e80865715c0b953][0m
[0m[1mgoogle_storage_bucket_iam_member.member["pangeo-scratch"]: Refreshing state... [id=b/pangeo-hubs-pangeo-scratch/roles/storage.admin/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cd_sa_roles["roles/container.admin"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/container.admin/serviceAccount:pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/artifactregistry.writer/serviceAccount:pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/monitoring.viewer/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/stackdriver.resourceMetadata.writer/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/artifactregistry.reader/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cluster_sa_roles["roles/logging.logWriter"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/logging.logWriter/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/monitoring.metricWriter/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_filestore_instance.homedirs[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/instances/pangeo-hubs-homedirs][0m
[0m[1mgoogle_compute_router.router[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/regions/us-central1/routers/pangeo-hubs-router][0m
[0m[1mgoogle_compute_firewall.iap_ssh_ingress[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/global/firewalls/allow-ssh][0m
[0m[1mgoogle_project_iam_member.identify_project_binding: Refreshing state... [id=pangeo-integration-te-3eea/projects/pangeo-integration-te-3eea/roles/pangeo_hubs_user_sa_role/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com][0m
[0m[1mgoogle_container_cluster.cluster: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster][0m
[0m[1mgoogle_compute_router_nat.nat[0]: Refreshing state... [id=pangeo-integration-te-3eea/us-central1/pangeo-hubs-router/pangeo-hubs-router-nat][0m
[0m[1mgoogle_container_node_pool.dask_worker["large"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-large][0m
[0m[1mgoogle_container_node_pool.notebook["small"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-small][0m
[0m[1mgoogle_container_node_pool.dask_worker["small"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-small][0m
[0m[1mgoogle_container_node_pool.notebook["medium"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-medium][0m
[0m[1mgoogle_container_node_pool.notebook["large"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-large][0m
[0m[1mgoogle_container_node_pool.dask_worker["medium"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-medium][0m
[0m[1mgoogle_container_node_pool.core: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_container_cluster.cluster[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_container_cluster" "cluster" {
        [1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster"
        [1m[0mname[0m[0m                        = "pangeo-hubs-cluster"
        [90m# (27 unchanged attributes hidden)[0m[0m












      [33m~[0m [0mnode_pool {
            [1m[0mname[0m[0m                        = "core-pool"
          [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 3 [33m->[0m [0m2
            [90m# (6 unchanged attributes hidden)[0m[0m





            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m [0mnode_pool {
            [1m[0mname[0m[0m                        = "nb-medium"
          [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m1
            [90m# (6 unchanged attributes hidden)[0m[0m





            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m [0mnode_pool {
            [1m[0mname[0m[0m                        = "nb-large"
          [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 2 [33m->[0m [0m1
            [90m# (6 unchanged attributes hidden)[0m[0m





            [90m# (5 unchanged blocks hidden)[0m[0m
        }
      [33m~[0m [0mnode_pool {
            [1m[0mname[0m[0m                        = "dask-medium"
          [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 14 [33m->[0m [0m0
            [90m# (6 unchanged attributes hidden)[0m[0m





            [90m# (5 unchanged blocks hidden)[0m[0m
        }





        [90m# (19 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.core[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_container_node_pool" "core" {
        [1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool"
        [1m[0mname[0m[0m                        = "core-pool"
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 3 [33m->[0m [0m2
        [90m# (9 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.dask_worker["medium"][0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_container_node_pool" "dask_worker" {
        [1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-medium"
        [1m[0mname[0m[0m                        = "dask-medium"
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 14 [33m->[0m [0m0
        [90m# (9 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.notebook["large"][0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_container_node_pool" "notebook" {
        [1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-large"
        [1m[0mname[0m[0m                        = "nb-large"
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 2 [33m->[0m [0m1
        [90m# (9 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.notebook["medium"][0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_container_node_pool" "notebook" {
        [1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-medium"
        [1m[0mname[0m[0m                        = "nb-medium"
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m1
        [90m# (9 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # google_container_node_pool.dask_worker["large"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "dask_worker" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-large" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-dask-large-8741828e-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-dask-large-8741828e-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "dask-large"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-ssd" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.dask_worker["medium"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "dask_worker" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-medium" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-dask-medium-f0702139-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-dask-medium-f0702139-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "dask-medium"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-ssd" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.dask_worker["small"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "dask_worker" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-small" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-dask-small-abfb145b-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-dask-small-abfb145b-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "dask-small"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-ssd" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.notebook["large"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "notebook" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-large" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-nb-large-7ec2a078-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-nb-large-7ec2a078-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "nb-large"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-standard" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.notebook["medium"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "notebook" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-medium" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-nb-medium-04a21a74-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-nb-medium-04a21a74-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "nb-medium"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-standard" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_container_node_pool.notebook["small"][0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_container_node_pool" "notebook" {
      [33m~[0m [0m[1m[0mid[0m[0m                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-small" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_group_urls[0m[0m         = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-nb-small-ef9b4ca7-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmanaged_instance_group_urls[0m[0m = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-nb-small-ef9b4ca7-grp",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmax_pods_per_node[0m[0m           = 110 [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                        = "nb-small"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mnode_count[0m[0m                  = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mnode_locations[0m[0m              = [
          [31m-[0m [0m"us-central1-b",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0mversion[0m[0m                     = "1.20.8-gke.2101" [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m



      [33m~[0m [0mnode_config {
          [33m~[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdisk_type[0m[0m         = "pd-standard" [33m->[0m [0m"pd-balanced" [31m# forces replacement[0m[0m
          [33m~[0m [0m[1m[0mguest_accelerator[0m[0m = [] [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mimage_type[0m[0m        = "COS_CONTAINERD" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mlocal_ssd_count[0m[0m   = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmetadata[0m[0m          = {
              [31m-[0m [0m"disable-legacy-endpoints" = "true"
            } [33m->[0m [0m(known after apply)
            [1m[0mtags[0m[0m              = []
            [90m# (6 unchanged attributes hidden)[0m[0m

          [33m~[0m [0mshielded_instance_config {
              [33m~[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0menable_secure_boot[0m[0m          = false [33m->[0m [0m(known after apply)
            }

            [90m# (1 unchanged block hidden)[0m[0m
        }

      [33m~[0m [0mupgrade_settings {
          [33m~[0m [0m[1m[0mmax_surge[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmax_unavailable[0m[0m = 0 [33m->[0m [0m(known after apply)
        }
        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[0m[1mPlan:[0m 6 to add, 0 to change, 6 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with google_filestore_instance.homedirs,
[33m│[0m [0m  on storage.tf line 4, in resource "google_filestore_instance" "homedirs":
[33m│[0m [0m   4:   zone = [4mvar.zone[0m[0m
[33m│[0m [0m
[33m│[0m [0mDeprecated in favor of location.
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
</pre>
</details>